In [2]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [3]:
ser1= Series([0, 1, 2], index= ['A', 'B', 'C'])
ser1

A    0
B    1
C    2
dtype: int64

In [4]:
ser2= Series([3, 4, 5, 6], index= ['A', 'B', 'C', 'D'])
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [5]:
ser1 + ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [6]:
dframe1= DataFrame(np.arange(4).reshape(2, 2), 
               ['NYC', 'LA'])
dframe1

     0  1
NYC  0  1
LA   2  3

In [9]:
dframe2= DataFrame(np.arange(9).reshape(3, 3), 
                   columns= list('ADC'), index= ['NYC', 'SF', 'LA'])
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [10]:
dframe1 + dframe2

/usr/local/lib/python3.6/site-packages/pandas/core/indexes/base.py:3033: RuntimeWarning: '<' not supported between instances of 'int' and 'str', sort order is undefined for incomparable objects
  return this.join(other, how=how, return_indexers=return_indexers)

      0   1   A   D   C
LA  NaN NaN NaN NaN NaN
NYC NaN NaN NaN NaN NaN
SF  NaN NaN NaN NaN NaN

In [11]:
dframe1 = DataFrame(np.arange(4).reshape(2,2),columns=list('AB'),index=['NYC','LA'])
dframe1

     A  B
NYC  0  1
LA   2  3

In [12]:
dframe1 + dframe2

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [14]:
dframe1.add(dframe2, fill_value= 0)

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [15]:
dframe2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [16]:
ser3= dframe2.ix[0]
ser3

/usr/local/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

A    0
D    1
C    2
Name: NYC, dtype: int64

In [17]:
dframe2- ser3

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6